tap "derailed/k9s"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "smallzoodev/fink"

# 런타임/버전 관리
brew "asdf"

# 에디터
brew "neovim"
brew "vim"

# CLI 도구
brew "fzf"
brew "bat"
brew "jq"
brew "gh"
brew "git"
brew "git-delta"
brew "fasd"
brew "the_silver_searcher"
brew "ripgrep"
brew "pandoc"
brew "wget"
brew "glances"

# AWS
brew "awscli"
brew "aws-vault"
brew "saml2aws"
brew "awslogs"

# K8s
brew "kubernetes-cli"
brew "argocd"
brew "helm"
brew "kubectx"
brew "derailed/k9s/k9s"
brew "minikube"

# 인프라/언어
brew "terraform"
brew "rust"
brew "redis"
brew "perl"
brew "python@3.13"
brew "libpq"

# 미디어/보안/기타
brew "ffmpeg"
brew "gnupg"
brew "potrace"
brew "smallzoodev/fink/fink"

# Cask - GUI 앱
cask "nikitabobko/tap/aerospace"
cask "codex"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-nanum-gothic"
cask "gcloud-cli"
cask "iterm2"
cask "karabiner-elements"
cask "maccy"
cask "microsoft-remote-desktop"
cask "ngrok"
cask "obsidian"
cask "spectacle"
cask "stats"
cask "visual-studio-code"
cask "warp"

# Cask - 개발 도구
cask "cursor"
cask "dbeaver-community"
cask "postman"
cask "figma"
cask "hammerspoon"
cask "claude"

# Cask - 커뮤니케이션
cask "slack"
cask "microsoft-teams"
cask "beeper"

# Cask - 네트워크/보안
cask "tailscale"

# Cask - 유틸리티
cask "raycast"
cask "hidden-bar"
cask "appcleaner"
cask "keka"
cask "scroll-reverser"
cask "cyberduck"
cask "amphetamine"

# VS Code Extensions
vscode "akamud.vscode-javascript-snippet-pack"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "aws-scripting-guy.cform"
vscode "bradlc.vscode-tailwindcss"
vscode "chekweitan.compare-view"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "hashicorp.terraform"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "run-at-scale.terraform-doc-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"