tap "derailed/k9s"
tap "hashicorp/tap"
tap "nikitabobko/tap"

# 런타임/버전 관리
brew "asdf"

# 에디터
brew "neovim"
brew "vim"

# CLI 도구
brew "fzf"
brew "bat"
brew "jq"
brew "gh"
brew "git"
brew "git-delta"
brew "the_silver_searcher"
brew "ripgrep"
brew "pandoc"
brew "wget"

# AWS
brew "awscli"
brew "aws-vault"
brew "saml2aws"
brew "awslogs"

# K8s
brew "kubernetes-cli"
brew "argocd"
brew "helm"
brew "kubectx"
brew "derailed/k9s/k9s"
brew "minikube"

# 인프라/언어
brew "rust"
brew "redis"
brew "perl"
brew "python@3.13"
brew "libpq"

# 미디어/보안/기타
brew "ffmpeg"

# Cask - GUI 앱
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-nanum-gothic"
cask "gcloud-cli"
cask "karabiner-elements"
cask "maccy"
cask "obsidian"
cask "stats"

# Cask - 개발 도구
cask "hammerspoon"
cask "claude"

# Cask - 커뮤니케이션
cask "slack"
cask "microsoft-teams"

# Cask - 네트워크/보안
cask "tailscale"

# Cask - 유틸리티
cask "raycast"
cask "appcleaner"
cask "keka"
cask "scroll-reverser"
